code/apitest/features/xml/request/basic_auth_create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:zato="https://zato.io/ns/20130518">
   <soapenv:Body>
      <zato:zato_security_basic_auth_create_request>
         <zato:cluster_id>1</zato:cluster_id>
         <zato:name>CRM Client 1</zato:name>
         <zato:is_active>true</zato:is_active>
         <zato:username>crmclient1</zato:username>
         <zato:realm>ESB</zato:realm>
      </zato:zato_security_basic_auth_create_request>
   </soapenv:Body>
</soapenv:Envelope>